LA7LKA/AmateurRadioDMRRepeater/software/SiLabs/Si446x_EmptyFramework/src/drivers/C8051F910_defs_add.h

// SFR Definition 5.1. ADC0CN: ADC0 Control
#define   B_AD0EN        7         // ADC0 Enable.
#define   M_AD0EN        0x80      // ADC0 Enable.
#define   B_BURSTEN      6         // ADC0 Burst Mode Enable.
#define   M_BURSTEN      0x40      // ADC0 Burst Mode Enable.
#define   B_AD0INT       5         // ADC0 Conversion Complete Interrupt Flag.
#define   M_AD0INT       0x20      // ADC0 Conversion Complete Interrupt Flag.
#define   B_AD0BUSY      4         // ADC0 Busy.
#define   M_AD0BUSY      0x10      // ADC0 Busy.
#define   B_AD0WINT      3         // ADC0 Window Compare Interrupt Flag.
#define   M_AD0WINT      0x08      // ADC0 Window Compare Interrupt Flag.
#define   BF_ADC0CM      0         // ADC0 Start of Conversion Mode Select.
#define   BF_ADC0CM_0    0         // ADC0 Start of Conversion Mode Select.
#define   BF_ADC0CM_1    1         // ADC0 Start of Conversion Mode Select.
#define   BF_ADC0CM_2    2         // ADC0 Start of Conversion Mode Select.
#define   M_ADC0CM       0x07      // ADC0 Start of Conversion Mode Select.

// SFR Definition 5.2. ADC0CF: ADC0 Configuration
#define   BF_AD0SC       3         // ADC0 SAR Conversion Clock Divider.
#define   BF_AD0SC_0     3         // ADC0 SAR Conversion Clock Divider.
#define   BF_AD0SC_1     4         // ADC0 SAR Conversion Clock Divider.
#define   BF_AD0SC_2     5         // ADC0 SAR Conversion Clock Divider.
#define   BF_AD0SC_3     6         // ADC0 SAR Conversion Clock Divider.
#define   BF_AD0SC_4     7         // ADC0 SAR Conversion Clock Divider.
#define   M_AD0SC        0xF8      // ADC0 SAR Conversion Clock Divider.
#define   B_AD08BE       2         // ADC0 8-Bit Mode Enable.
#define   M_AD08BE       0x04      // ADC0 8-Bit Mode Enable.
#define   B_AD0TM        1         // ADC0 Track Mode.
#define   M_AD0TM        0x02      // ADC0 Track Mode.
#define   B_AMP0GN       0         // ADC0 Gain Control. 
#define   M_AMP0GN       0x01      // ADC0 Gain Control. 

// SFR Definition 5.3. ADC0AC: ADC0 Accumulator Configuration
#define   B_AD012BE      7         // ADC0 12-Bit Mode Enable. 
#define   M_AD012BE      0x80      // ADC0 12-Bit Mode Enable. 
#define   B_AD0AE        6         // ADC0 Accumulate Enable.
#define   M_AD0AE        0x40      // ADC0 Accumulate Enable.
#define   BF_AD0SJST     3         // ADC0 Accumulator Shift and Justify.
#define   BF_AD0SJST_0   3         // ADC0 Accumulator Shift and Justify.
#define   BF_AD0SJST_1   4         // ADC0 Accumulator Shift and Justify.
#define   BF_AD0SJST_2   5         // ADC0 Accumulator Shift and Justify.
#define   M_AD0SJST      0x38      // ADC0 Accumulator Shift and Justify.
#define   BF_AD0RPT      0         // ADC0 Repeat Count.
#define   BF_AD0RPT_0    0         // ADC0 Repeat Count.
#define   BF_AD0RPT_1    1         // ADC0 Repeat Count.
#define   BF_AD0RPT_2    2         // ADC0 Repeat Count.
#define   M_AD0RPT       0x07      // ADC0 Repeat Count.

// SFR Definition 5.4. ADC0PWR: ADC0 Burst Mode Power-Up Time
#define   B_AD0LPM       7         // ADC0 Low Power Mode Enable.
#define   M_AD0LPM       0x80      // ADC0 Low Power Mode Enable.
#define   BF_AD0PWR      0         // ADC0 Burst Mode Power-Up Time.
#define   BF_AD0PWR_0    0         // ADC0 Burst Mode Power-Up Time.
#define   BF_AD0PWR_1    1         // ADC0 Burst Mode Power-Up Time.
#define   BF_AD0PWR_2    2         // ADC0 Burst Mode Power-Up Time.
#define   BF_AD0PWR_3    3         // ADC0 Burst Mode Power-Up Time.
#define   M_AD0PWR       0x0F      // ADC0 Burst Mode Power-Up Time.

// SFR Definition 5.5. ADC0TK: ADC0 Burst Mode Track Time
#define   BF_R           6         // Reserved. 
#define   BF_R_0         6         // Reserved. 
#define   BF_R_1         7         // Reserved. 
#define   M_R            0xC0      // Reserved. 
#define   BF_AD0TK       0         // ADC0 Burst Mode Track Time.
#define   BF_AD0TK_0     0         // ADC0 Burst Mode Track Time.
#define   BF_AD0TK_1     1         // ADC0 Burst Mode Track Time.
#define   BF_AD0TK_2     2         // ADC0 Burst Mode Track Time.
#define   BF_AD0TK_3     3         // ADC0 Burst Mode Track Time.
#define   BF_AD0TK_4     4         // ADC0 Burst Mode Track Time.
#define   BF_AD0TK_5     5         // ADC0 Burst Mode Track Time.
#define   M_AD0TK        0x3F      // ADC0 Burst Mode Track Time.

// SFR Definition 5.12. ADC0MX: ADC0 Input Channel Select
#define   BF_AD0MX       0         // AMUX0 Positive Input Selection.
#define   BF_AD0MX_0     0         // AMUX0 Positive Input Selection.
#define   BF_AD0MX_1     1         // AMUX0 Positive Input Selection.
#define   BF_AD0MX_2     2         // AMUX0 Positive Input Selection.
#define   BF_AD0MX_3     3         // AMUX0 Positive Input Selection.
#define   BF_AD0MX_4     4         // AMUX0 Positive Input Selection.
#define   M_AD0MX        0x1F      // AMUX0 Positive Input Selection.

// SFR Definition 5.14. TOFFL: ADC0 Data Word Low Byte
#define   BF_TOFF        6         // Temperature Sensor Offset Low Bits.
#define   BF_TOFF_0      6         // Temperature Sensor Offset Low Bits.
#define   BF_TOFF_1      7         // Temperature Sensor Offset Low Bits.
#define   M_TOFF         0xC0      // Temperature Sensor Offset Low Bits.

// SFR Definition 5.15. REF0CN: Voltage Reference Control
#define   B_REFGND       5         // Analog Ground Reference.
#define   M_REFGND       0x20      // Analog Ground Reference.
#define   BF_REFSL       3         // Voltage Reference Select. 
#define   BF_REFSL_0     3         // Voltage Reference Select. 
#define   BF_REFSL_1     4         // Voltage Reference Select. 
#define   M_REFSL        0x18      // Voltage Reference Select. 
#define   B_TEMPE        2         // Temperature Sensor Enable.
#define   M_TEMPE        0x04      // Temperature Sensor Enable.
#define   B_REFOE        0         // Internal Voltage Reference Output Enable. 
#define   M_REFOE        0x01      // Internal Voltage Reference Output Enable. 

