LA7LKA/AmateurRadioDMRRepeater/software/SiLabs/Si446x_EmptyFramework/src/drivers/C8051F910_defs_add.h
// SFR Definition 6.1. IREF0CN: Current Reference Control
#define   B_SINK         7         // IREF0 Current Sink Enable.
#define   M_SINK         0x80      // IREF0 Current Sink Enable.
#define   B_MDSEL        6         // IREF0 Output Mode Select. 
#define   M_MDSEL        0x40      // IREF0 Output Mode Select. 
#define   BF_IREF0DAT    0         // IREF0 Data Word.
#define   BF_IREF0DAT_0  0         // IREF0 Data Word.
#define   BF_IREF0DAT_1  1         // IREF0 Data Word.
#define   BF_IREF0DAT_2  2         // IREF0 Data Word.
#define   BF_IREF0DAT_3  3         // IREF0 Data Word.
#define   BF_IREF0DAT_4  4         // IREF0 Data Word.
#define   BF_IREF0DAT_5  5         // IREF0 Data Word.
#define   M_IREF0DAT     0x3F      // IREF0 Data Word.

// SFR Definition 6.2. IREF0CF: Current Reference Configuration
#define   B_PWMEN        7         // PWM Enhanced Mode Enable.
#define   M_PWMEN        0x80      // PWM Enhanced Mode Enable.
#define   BF_PWMSS       0         // PWM Source Select.
#define   BF_PWMSS_0     0         // PWM Source Select.
#define   BF_PWMSS_1     1         // PWM Source Select.
#define   BF_PWMSS_2     2         // PWM Source Select.
#define   M_PWMSS        0x07      // PWM Source Select.

// SFR Definition 7.1. CPT0CN: Comparator 0 Control
#define   B_CP0EN        7         // Comparator0 Enable Bit.
#define   M_CP0EN        0x80      // Comparator0 Enable Bit.
#define   B_CP0OUT       6         // Comparator0 Output State Flag.
#define   M_CP0OUT       0x40      // Comparator0 Output State Flag.
#define   B_CP0RIF       5         // Comparator0 Rising-Edge Flag. Must be cleared by software.
#define   M_CP0RIF       0x20      // Comparator0 Rising-Edge Flag. Must be cleared by software.
#define   B_CP0FIF       4         // Comparator0 Falling-Edge Flag. Must be cleared by software.
#define   M_CP0FIF       0x10      // Comparator0 Falling-Edge Flag. Must be cleared by software.
#define   BF_CP0HYN      0         // Comparator0 Negative Hysteresis Control Bits.
#define   BF_CP0HYN_0    0         // Comparator0 Negative Hysteresis Control Bits.
#define   BF_CP0HYN_1    1         // Comparator0 Negative Hysteresis Control Bits.
#define   M_CP0HYN       0x03      // Comparator0 Negative Hysteresis Control Bits.

// SFR Definition 7.2. CPT0MD: Comparator 0 Mode Selection
#define   B_CP0RIE       5         // Comparator0 Rising-Edge Interrupt Enable.
#define   M_CP0RIE       0x20      // Comparator0 Rising-Edge Interrupt Enable.
#define   B_CP0FIE       4         // Comparator0 Falling-EdgeInterrupt Enable.
#define   M_CP0FIE       0x10      // Comparator0 Falling-EdgeInterrupt Enable.
#define   BF_CP0MD       0         // Comparator0 Mode Select
#define   BF_CP0MD_0     0         // Comparator0 Mode Select
#define   BF_CP0MD_1     1         // Comparator0 Mode Select
#define   M_CP0MD        0x03      // Comparator0 Mode Select

// SFR Definition 7.3. CPT1CN: Comparator 1 Control
#define   B_CP1EN        7         // Comparator1 Enable Bit.
#define   M_CP1EN        0x80      // Comparator1 Enable Bit.
#define   B_CP1OUT       6         // Comparator1 Output State Flag.
#define   M_CP1OUT       0x40      // Comparator1 Output State Flag.
#define   B_CP1RIF       5         // Comparator1 Rising-Edge Flag. Must be cleared by software.
#define   M_CP1RIF       0x20      // Comparator1 Rising-Edge Flag. Must be cleared by software.
#define   B_CP1FIF       4         // Comparator1 Falling-Edge Flag. Must be cleared by software.
#define   M_CP1FIF       0x10      // Comparator1 Falling-Edge Flag. Must be cleared by software.
#define   BF_CP1HYP      2         // Comparator1 Positive Hysteresis Control Bits.
#define   BF_CP1HYP_0    2         // Comparator1 Positive Hysteresis Control Bits.
#define   BF_CP1HYP_1    3         // Comparator1 Positive Hysteresis Control Bits.
#define   M_CP1HYP       0x0C      // Comparator1 Positive Hysteresis Control Bits.
#define   BF_CP1HYN      0         // Comparator1 Negative Hysteresis Control Bits.
#define   BF_CP1HYN_0    0         // Comparator1 Negative Hysteresis Control Bits.
#define   BF_CP1HYN_1    1         // Comparator1 Negative Hysteresis Control Bits.
#define   M_CP1HYN       0x03      // Comparator1 Negative Hysteresis Control Bits.

// SFR Definition 7.4. CPT1MD: Comparator 1 Mode Selection
#define   B_CP1RIE       5         // Comparator1 Rising-Edge Interrupt Enable.
#define   M_CP1RIE       0x20      // Comparator1 Rising-Edge Interrupt Enable.
#define   B_CP1FIE       4         // Comparator1 Falling-EdgeInterrupt Enable.
#define   M_CP1FIE       0x10      // Comparator1 Falling-EdgeInterrupt Enable.
#define   BF_CP1MD       0         // Comparator1 Mode Select
#define   BF_CP1MD_0     0         // Comparator1 Mode Select
#define   BF_CP1MD_1     1         // Comparator1 Mode Select
#define   M_CP1MD        0x03      // Comparator1 Mode Select

// SFR Definition 7.5. CPT0MX: Comparator0 Input Channel Select
#define   BF_CMX0N       4         // Comparator0 Negative Input Selection.
#define   BF_CMX0N_0     4         // Comparator0 Negative Input Selection.
#define   BF_CMX0N_1     5         // Comparator0 Negative Input Selection.
#define   BF_CMX0N_2     6         // Comparator0 Negative Input Selection.
#define   BF_CMX0N_3     7         // Comparator0 Negative Input Selection.
#define   M_CMX0N        0xF0      // Comparator0 Negative Input Selection.
#define   BF_CMX0P       0         // Comparator0 Positive Input Selection.
#define   BF_CMX0P_0     0         // Comparator0 Positive Input Selection.
#define   BF_CMX0P_1     1         // Comparator0 Positive Input Selection.
#define   BF_CMX0P_2     2         // Comparator0 Positive Input Selection.
#define   BF_CMX0P_3     3         // Comparator0 Positive Input Selection.
#define   M_CMX0P        0x0F      // Comparator0 Positive Input Selection.

// SFR Definition 7.6. CPT1MX: Comparator1 Input Channel Select
#define   BF_CMX1N       4         // Comparator1 Negative Input Selection.
#define   BF_CMX1N_0     4         // Comparator1 Negative Input Selection.
#define   BF_CMX1N_1     5         // Comparator1 Negative Input Selection.
#define   BF_CMX1N_2     6         // Comparator1 Negative Input Selection.
#define   BF_CMX1N_3     7         // Comparator1 Negative Input Selection.
#define   M_CMX1N        0xF0      // Comparator1 Negative Input Selection.
#define   BF_CMX1P       0         // Comparator1 Positive Input Selection.
#define   BF_CMX1P_0     0         // Comparator1 Positive Input Selection.
#define   BF_CMX1P_1     1         // Comparator1 Positive Input Selection.
#define   BF_CMX1P_2     2         // Comparator1 Positive Input Selection.
#define   BF_CMX1P_3     3         // Comparator1 Positive Input Selection.
#define   M_CMX1P        0x0F      // Comparator1 Positive Input Selection.

// SFR Definition 8.6. PSW: Program Status Word
#define   B_CY           7         // Carry Flag.
#define   M_CY           0x80      // Carry Flag.
#define   B_AC           6         // Auxiliary Carry Flag.
#define   M_AC           0x40      // Auxiliary Carry Flag.
#define   B_F0           5         // User Flag 0.
#define   M_F0           0x20      // User Flag 0.
#define   BF_RS          3         // Register Bank Select.
#define   BF_RS_0        3         // Register Bank Select.
#define   BF_RS_1        4         // Register Bank Select.
#define   M_RS           0x18      // Register Bank Select.
#define   B_OV           2         // Overflow Flag.
#define   M_OV           0x04      // Overflow Flag.
#define   B_F1           1         // User Flag 1.
#define   M_F1           0x02      // User Flag 1.
#define   B_PARITY       0         // Parity Flag.
#define   M_PARITY       0x01      // Parity Flag.

