LA7LKA/AmateurRadioDMRRepeater/software/SiLabs/Si446x_EmptyFramework/src/drivers/C8051F910_defs_add.h
// SFR Definition 10.1. EMI0CN: External Memory Interface Control
#define   B_PGSEL        0         // XRAM Page Select.
#define   M_PGSEL        0x01      // XRAM Page Select.

// SFR Definition 12.1. IE: Interrupt Enable
#define   B_EA           7         // Enable All Interrupts.
#define   M_EA           0x80      // Enable All Interrupts.
#define   B_ESPI0        6         // Enable Serial Peripheral Interface (SPI0) Interrupt.
#define   M_ESPI0        0x40      // Enable Serial Peripheral Interface (SPI0) Interrupt.
#define   B_ET2          5         // Enable Timer 2 Interrupt.
#define   M_ET2          0x20      // Enable Timer 2 Interrupt.
#define   B_ES0          4         // Enable UART0 Interrupt.
#define   M_ES0          0x10      // Enable UART0 Interrupt.
#define   B_ET1          3         // Enable Timer 1 Interrupt. 
#define   M_ET1          0x08      // Enable Timer 1 Interrupt. 
#define   B_EX1          2         // Enable External Interrupt 1. 
#define   M_EX1          0x04      // Enable External Interrupt 1. 
#define   B_ET0          1         // Enable Timer 0 Interrupt. 
#define   M_ET0          0x02      // Enable Timer 0 Interrupt. 
#define   B_EX0          0         // Enable External Interrupt 0. 
#define   M_EX0          0x01      // Enable External Interrupt 0. 

// SFR Definition 12.2. IP: Interrupt Priority
#define   B_PSPI0        6         // Serial Peripheral Interface (SPI0) Interrupt Priority Control.
#define   M_PSPI0        0x40      // Serial Peripheral Interface (SPI0) Interrupt Priority Control.
#define   B_PT2          5         // Timer 2 Interrupt Priority Control. 
#define   M_PT2          0x20      // Timer 2 Interrupt Priority Control. 
#define   B_PS0          4         // UART0 Interrupt Priority Control. 
#define   M_PS0          0x10      // UART0 Interrupt Priority Control. 
#define   B_PT1          3         // Timer 1 Interrupt Priority Control.
#define   M_PT1          0x08      // Timer 1 Interrupt Priority Control.
#define   B_PX1          2         // External Interrupt 1 Priority Control. 
#define   M_PX1          0x04      // External Interrupt 1 Priority Control. 
#define   B_PT0          1         // Timer 0 Interrupt Priority Control. 
#define   M_PT0          0x02      // Timer 0 Interrupt Priority Control. 
#define   B_PX0          0         // External Interrupt 0 Priority Control. 
#define   M_PX0          0x01      // External Interrupt 0 Priority Control. 

// SFR Definition 12.3. EIE1: Extended Interrupt Enable 1
#define   B_ET3          7         // Enable Timer 3 Interrupt.
#define   M_ET3          0x80      // Enable Timer 3 Interrupt.
#define   B_ECP1         6         // Enable Comparator1 (CP1) Interrupt.
#define   M_ECP1         0x40      // Enable Comparator1 (CP1) Interrupt.
#define   B_ECP0         5         // Enable Comparator0 (CP0) Interrupt.
#define   M_ECP0         0x20      // Enable Comparator0 (CP0) Interrupt.
#define   B_EPCA0        4         // Enable Programmable Counter Array (PCA0) Interrupt.
#define   M_EPCA0        0x10      // Enable Programmable Counter Array (PCA0) Interrupt.
#define   B_EADC0        3         // Enable ADC0 Conversion Complete Interrupt.
#define   M_EADC0        0x08      // Enable ADC0 Conversion Complete Interrupt.
#define   B_EWADC0       2         // Enable Window Comparison ADC0 Interrupt. 
#define   M_EWADC0       0x04      // Enable Window Comparison ADC0 Interrupt. 
#define   B_ERTC0A       1         // Enable SmaRTClock Alarm Interrupts. 
#define   M_ERTC0A       0x02      // Enable SmaRTClock Alarm Interrupts. 
#define   B_ESMB0        0         // Enable SMBus (SMB0) Interrupt. 
#define   M_ESMB0        0x01      // Enable SMBus (SMB0) Interrupt. 

// SFR Definition 12.4. EIP1: Extended Interrupt Priority 1
#define   B_PT3          7         // Timer 3 Interrupt Priority Control. 
#define   M_PT3          0x80      // Timer 3 Interrupt Priority Control. 
#define   B_PCP1         6         // Comparator1 (CP1) Interrupt Priority Control.
#define   M_PCP1         0x40      // Comparator1 (CP1) Interrupt Priority Control.
#define   B_PCP0         5         // Comparator0 (CP0) Interrupt Priority Control.
#define   M_PCP0         0x20      // Comparator0 (CP0) Interrupt Priority Control.
#define   B_PPCA0        4         // Programmable Counter Array (PCA0) Interrupt Priority Control.
#define   M_PPCA0        0x10      // Programmable Counter Array (PCA0) Interrupt Priority Control.
#define   B_PADC0        3         // ADC0 Conversion Complete Interrupt Priority Control.
#define   M_PADC0        0x08      // ADC0 Conversion Complete Interrupt Priority Control.
#define   B_PWADC0       2         // ADC0 Window Comparator Interrupt Priority Control.
#define   M_PWADC0       0x04      // ADC0 Window Comparator Interrupt Priority Control.
#define   B_PRTC0A       1         // SmaRTClock Alarm Interrupt Priority Control. 
#define   M_PRTC0A       0x02      // SmaRTClock Alarm Interrupt Priority Control. 
#define   B_PSMB0        0         // SMBus (SMB0) Interrupt Priority Control.
#define   M_PSMB0        0x01      // SMBus (SMB0) Interrupt Priority Control.

// SFR Definition 12.5. EIE2: Extended Interrupt Enable 2
#define   B_ESPI1        3         // Enable Serial Peripheral Interface (SPI1) Interrupt.
#define   M_ESPI1        0x08      // Enable Serial Peripheral Interface (SPI1) Interrupt.
#define   B_ERTC0F       2         // Enable SmaRTClock Oscillator Fail Interrupt. 
#define   M_ERTC0F       0x04      // Enable SmaRTClock Oscillator Fail Interrupt. 
#define   B_EMAT         1         // Enable Port Match Interrupts. 
#define   M_EMAT         0x02      // Enable Port Match Interrupts. 
#define   B_EWARN        0         // Enable Supply Monitor Early Warning Interrupt. 
#define   M_EWARN        0x01      // Enable Supply Monitor Early Warning Interrupt. 

// SFR Definition 12.6. EIP2: Extended Interrupt Priority 2
#define   B_PSPI1        3         // Serial Peripheral Interface (SPI1) Interrupt Priority Control.
#define   M_PSPI1        0x08      // Serial Peripheral Interface (SPI1) Interrupt Priority Control.
#define   B_PMAT         1         // Port Match Interrupt Priority Control. 
#define   M_PMAT         0x02      // Port Match Interrupt Priority Control. 
#define   B_PWARN        0         // Supply Monitor Early Warning Interrupt Priority Control. 
#define   M_PWARN        0x01      // Supply Monitor Early Warning Interrupt Priority Control. 

