LA7LKA/AmateurRadioDMRRepeater/software/SiLabs/Si446x_EmptyFramework/src/drivers/C8051F910_defs_add.h
// SFR Definition 12.7. IT01CF: INT0/INT1Configuration
#define   B_IN1PL        7         // INT1Polarity.
#define   M_IN1PL        0x80      // INT1Polarity.
#define   BF_IN1SL       4         // INT1Port Pin Selection Bits.
#define   BF_IN1SL_0     4         // INT1Port Pin Selection Bits.
#define   BF_IN1SL_1     5         // INT1Port Pin Selection Bits.
#define   BF_IN1SL_2     6         // INT1Port Pin Selection Bits.
#define   M_IN1SL        0x70      // INT1Port Pin Selection Bits.
#define   B_IN0PL        3         // INT0Polarity.
#define   M_IN0PL        0x08      // INT0Polarity.
#define   BF_IN0SL       0         // INT0Port Pin Selection Bits.
#define   BF_IN0SL_0     0         // INT0Port Pin Selection Bits.
#define   BF_IN0SL_1     1         // INT0Port Pin Selection Bits.
#define   BF_IN0SL_2     2         // INT0Port Pin Selection Bits.
#define   M_IN0SL        0x07      // INT0Port Pin Selection Bits.

// SFR Definition 13.1. PSCTL: Program Store R/W Control
#define   B_SFLE         2         // Scratchpad Flash Memory Access Enable.
#define   M_SFLE         0x04      // Scratchpad Flash Memory Access Enable.
#define   B_PSEE         1         // Program Store Erase Enable.
#define   M_PSEE         0x02      // Program Store Erase Enable.
#define   B_PSWE         0         // Program Store Write Enable.
#define   M_PSWE         0x01      // Program Store Write Enable.

// SFR Definition 13.3. FLSCL: Flash Scale
#define   B_BYPASS       6         // Flash Read Timing One-Shot Bypass.
#define   M_BYPASS       0x40      // Flash Read Timing One-Shot Bypass.

// SFR Definition 14.1. PMU0CF: Power Management Unit Configuration
#define   B_SLEEP        7         // Sleep Mode Select Writing 1 places the 
#define   M_SLEEP        0x80      // Sleep Mode Select Writing 1 places the 
#define   B_SUSPEND      6         // Suspend Mode Select Writing 1 places the 
#define   M_SUSPEND      0x40      // Suspend Mode Select Writing 1 places the 
#define   B_CLEAR        5         // Wake-up Flag Clear Writing 1 clears all wakeup flags.
#define   M_CLEAR        0x20      // Wake-up Flag Clear Writing 1 clears all wakeup flags.
#define   B_RSTWK        4         // Reset Pin Wake-up Flag N/A Set to 1 if a falling edge 
#define   M_RSTWK        0x10      // Reset Pin Wake-up Flag N/A Set to 1 if a falling edge 
#define   B_RTCFWK       3         // SmaRTClock Oscillator 
#define   M_RTCFWK       0x08      // SmaRTClock Oscillator 
#define   B_RTCAWK       2         // SmaRTClock Alarm 
#define   M_RTCAWK       0x04      // SmaRTClock Alarm 
#define   B_PMATWK       1         // Port Match Wake-up 
#define   M_PMATWK       0x02      // Port Match Wake-up 
#define   B_CPT0WK       0         // Comparator0 Wake-up 
#define   M_CPT0WK       0x01      // Comparator0 Wake-up 

// SFR Definition 14.2. PMU0MD: Power Management Unit Mode
#define   B_RTCOE        7         // Buffered SmaRTClock Output Enable.
#define   M_RTCOE        0x80      // Buffered SmaRTClock Output Enable.
#define   B_WAKEOE       6         // Wakeup Request Output Enable.
#define   M_WAKEOE       0x40      // Wakeup Request Output Enable.
#define   B_MONDIS       5         // VBAT Supply Monitor Disable.
#define   M_MONDIS       0x20      // VBAT Supply Monitor Disable.

// SFR Definition 14.3. PCON: Power Management Control Register
#define   BF_GF          2         // General Purpose Flags Sets the logic value. Returns the logic value.
#define   BF_GF_0        2         // General Purpose Flags Sets the logic value. Returns the logic value.
#define   BF_GF_1        3         // General Purpose Flags Sets the logic value. Returns the logic value.
#define   BF_GF_2        4         // General Purpose Flags Sets the logic value. Returns the logic value.
#define   BF_GF_3        5         // General Purpose Flags Sets the logic value. Returns the logic value.
#define   BF_GF_4        6         // General Purpose Flags Sets the logic value. Returns the logic value.
#define   BF_GF_5        7         // General Purpose Flags Sets the logic value. Returns the logic value.
#define   M_GF           0xFC      // General Purpose Flags Sets the logic value. Returns the logic value.
#define   B_STOP         1         // Stop Mode Select Writing 1 places the 
#define   M_STOP         0x02      // Stop Mode Select Writing 1 places the 
#define   B_IDLE         0         // 
#define   M_IDLE         0x01      // 

// SFR Definition 15.1. CRC0CN: CRC0 Control
#define   B_CRC0SEL      4         // CRC0 Polynomial Select Bit.
#define   M_CRC0SEL      0x10      // CRC0 Polynomial Select Bit.
#define   B_CRC0INIT     3         // CRC0 Result Initialization Bit.
#define   M_CRC0INIT     0x08      // CRC0 Result Initialization Bit.
#define   B_CRC0VAL      2         // CRC0 Set Value Initialization Bit.
#define   M_CRC0VAL      0x04      // CRC0 Set Value Initialization Bit.
#define   BF_CRC0PNT     0         // Result Pointer.
#define   BF_CRC0PNT_0   0         // Result Pointer.
#define   BF_CRC0PNT_1   1         // Result Pointer.
#define   M_CRC0PNT      0x03      // Result Pointer.

// SFR Definition 15.4. CRC0AUTO: CRC0 Automatic Control
#define   B_AUTOEN       7         // Automatic CRC Calculation Enable.
#define   M_AUTOEN       0x80      // Automatic CRC Calculation Enable.
#define   B_CRCDONE      6         // CRCDONE Automatic CRC Calculation Complete.
#define   M_CRCDONE      0x40      // CRCDONE Automatic CRC Calculation Complete.
#define   BF_CRC0ST      0         // Automatic CRC Calculation Starting Flash Sector.
#define   BF_CRC0ST_0    0         // Automatic CRC Calculation Starting Flash Sector.
#define   BF_CRC0ST_1    1         // Automatic CRC Calculation Starting Flash Sector.
#define   BF_CRC0ST_2    2         // Automatic CRC Calculation Starting Flash Sector.
#define   BF_CRC0ST_3    3         // Automatic CRC Calculation Starting Flash Sector.
#define   BF_CRC0ST_4    4         // Automatic CRC Calculation Starting Flash Sector.
#define   BF_CRC0ST_5    5         // Automatic CRC Calculation Starting Flash Sector.
#define   M_CRC0ST       0x3F      // Automatic CRC Calculation Starting Flash Sector.

