LA7LKA/AmateurRadioDMRRepeater/software/SiLabs/Si446x_EmptyFramework/src/drivers/C8051F910_defs_add.h
// SFR Definition 15.5. CRC0CNT: CRC0 Automatic Flash Sector Count
#define   BF_CRC0CNT     0         // Automatic CRC Calculation Flash Sector Count.
#define   BF_CRC0CNT_0   0         // Automatic CRC Calculation Flash Sector Count.
#define   BF_CRC0CNT_1   1         // Automatic CRC Calculation Flash Sector Count.
#define   BF_CRC0CNT_2   2         // Automatic CRC Calculation Flash Sector Count.
#define   BF_CRC0CNT_3   3         // Automatic CRC Calculation Flash Sector Count.
#define   BF_CRC0CNT_4   4         // Automatic CRC Calculation Flash Sector Count.
#define   BF_CRC0CNT_5   5         // Automatic CRC Calculation Flash Sector Count.
#define   M_CRC0CNT      0x3F      // Automatic CRC Calculation Flash Sector Count.

// SFR Definition 16.1. DC0CN: DC-DC Converter Control
#define   BF_MINPW       6         // Converter Minimum Pulse Width.
#define   BF_MINPW_0     6         // Converter Minimum Pulse Width.
#define   BF_MINPW_1     7         // Converter Minimum Pulse Width.
#define   M_MINPW        0xC0      // Converter Minimum Pulse Width.
#define   B_SWSEL        5         // DC-DC Converter Switch Select. 
#define   M_SWSEL        0x20      // DC-DC Converter Switch Select. 
#define   B_SYNC         3         // ADC0 Synchronization Enable.
#define   M_SYNC         0x08      // ADC0 Synchronization Enable.
#define   BF_VSEL        0         // DC-DC Converter Output Voltage Select.
#define   BF_VSEL_0      0         // DC-DC Converter Output Voltage Select.
#define   BF_VSEL_1      1         // DC-DC Converter Output Voltage Select.
#define   BF_VSEL_2      2         // DC-DC Converter Output Voltage Select.
#define   M_VSEL         0x07      // DC-DC Converter Output Voltage Select.

// SFR Definition 16.2. DC0CF: DC-DC Converter Configuration
#define   B_LPEN         7         // Low Power Mode Enable.
#define   M_LPEN         0x80      // Low Power Mode Enable.
#define   BF_DC0CF_CLKDIV      5         // Clock Divider.
#define   BF_DC0CF_CLKDIV_0    5         // Clock Divider.
#define   BF_DC0CF_CLKDIV_1    6         // Clock Divider.
#define   M_DC0CF_CLKDIV       0x60      // Clock Divider.
#define   B_AD0CKINV     4         // ADC0 Clock Inversion (Clock Invert During Sync).
#define   M_AD0CKINV     0x10      // ADC0 Clock Inversion (Clock Invert During Sync).
#define   B_CLKINV       3         // DC-DC Converter Clock Invert.
#define   M_CLKINV       0x08      // DC-DC Converter Clock Invert.
#define   B_ILIMIT       2         // Peak Current Limit Threshold.
#define   M_ILIMIT       0x04      // Peak Current Limit Threshold.
#define   B_VDDSLP       1         // VDD-DC+ Sleep Mode Connection.
#define   M_VDDSLP       0x02      // VDD-DC+ Sleep Mode Connection.
#define   B_CLKSEL       0         // DC-DC Converter Clock Source Select.
#define   M_DC0CF_CLKSEL       0x01      // DC-DC Converter Clock Source Select.

// SFR Definition 16.3. DC0MD: DC-DC Mode
#define   B_BYPFLG       3         // Bypass Indicator.
#define   M_BYPFLG       0x08      // Bypass Indicator.
#define   BF_BYPSEL      1         // Mode Select.
#define   BF_BYPSEL_0    1         // Mode Select.
#define   BF_BYPSEL_1    2         // Mode Select.
#define   M_BYPSEL       0x06      // Mode Select.
#define   B_PASDEN       0         // Passive Diode Mode Enable.
#define   M_PASDEN       0x01      // Passive Diode Mode Enable.

// SFR Definition 17.1. REG0CN: Voltage Regulator Control
#define   B_OSCBIAS      4         // Precision Oscillator Bias.
#define   M_OSCBIAS      0x10      // Precision Oscillator Bias.

// SFR Definition 18.1. VDM0CN: VDD/DC+ Supply Monitor Control
#define   B_VDMEN        7         // VDD/DC+ Supply Monitor Enable.
#define   M_VDMEN        0x80      // VDD/DC+ Supply Monitor Enable.
#define   B_VDDSTAT      6         // VDD/DC+ Supply Status.
#define   M_VDDSTAT      0x40      // VDD/DC+ Supply Status.
#define   B_VDDOK        5         // VDD/DC+ Supply Status (Early Warning).
#define   M_VDDOK        0x20      // VDD/DC+ Supply Status (Early Warning).
#define   B_VBATOK       4         // VBAT Supply Status (Early Warning).
#define   M_VBATOK       0x10      // VBAT Supply Status (Early Warning).
#define   B_VDDOKIE      3         // VDD/DC+ Early Warning Interrupt Enable.
#define   M_VDDOKIE      0x08      // VDD/DC+ Early Warning Interrupt Enable.
#define   B_VBATOKIE     2         // VBAT Early Warning Interrupt Enable.
#define   M_VBATOKIE     0x04      // VBAT Early Warning Interrupt Enable.

// SFR Definition 18.2. RSTSRC: Reset Source
#define   B_RTC0RE       7         // SmaRTClock Reset Enable 
#define   M_RTC0RE       0x80      // SmaRTClock Reset Enable 
#define   B_FERROR       6         // Flash Error Reset Flag. N/A Set to 1 if Flash 
#define   M_FERROR       0x40      // Flash Error Reset Flag. N/A Set to 1 if Flash 
#define   B_C0RSEF       5         // Comparator0 Reset Enable 
#define   M_C0RSEF       0x20      // Comparator0 Reset Enable 
#define   B_SWRSF        4         // Software Reset Force and 
#define   M_SWRSF        0x10      // Software Reset Force and 
#define   B_PORSF        1         // Power-On / Power-Fail 
#define   M_PORSF        0x02      // Power-On / Power-Fail 
#define   B_PINRSF       0         // HW Pin Reset Flag. N/A Set to 1 if RSTpin caused 
#define   M_PINRSF       0x01      // HW Pin Reset Flag. N/A Set to 1 if RSTpin caused 

// SFR Definition 19.1. CLKSEL: Clock Select
#define   B_CLKRDY       7         // System Clock Divider Clock Ready Flag.
#define   M_CLKRDY       0x80      // System Clock Divider Clock Ready Flag.
#define   BF_CLKDIV      4         // System Clock Divider Bits.
#define   BF_CLKDIV_0    4         // System Clock Divider Bits.
#define   BF_CLKDIV_1    5         // System Clock Divider Bits.
#define   BF_CLKDIV_2    6         // System Clock Divider Bits.
#define   M_CLKDIV       0x70      // System Clock Divider Bits.
#define   BF_CLKSEL      0         // System Clock Select.
#define   BF_CLKSEL_0    0         // System Clock Select.
#define   BF_CLKSEL_1    1         // System Clock Select.
#define   BF_CLKSEL_2    2         // System Clock Select.
#define   M_CLKSEL       0x07      // System Clock Select.

// SFR Definition 19.2. OSCICN: Internal Oscillator Control
#define   B_IOSCEN       7         // Internal Oscillator Enable.
#define   M_IOSCEN       0x80      // Internal Oscillator Enable.
#define   B_IFRDY        6         // Internal Oscillator Frequency Ready Flag.
#define   M_IFRDY        0x40      // Internal Oscillator Frequency Ready Flag.

// SFR Definition 19.3. OSCICL: Internal Oscillator Calibration
#define   B_SSE          7         // Spread Spectrum Enable.
#define   M_SSE          0x80      // Spread Spectrum Enable.
#define   BF_OSCICL      0         // Internal Oscillator Calibration.
#define   BF_OSCICL_0    0         // Internal Oscillator Calibration.
#define   BF_OSCICL_1    1         // Internal Oscillator Calibration.
#define   BF_OSCICL_2    2         // Internal Oscillator Calibration.
#define   BF_OSCICL_3    3         // Internal Oscillator Calibration.
#define   BF_OSCICL_4    4         // Internal Oscillator Calibration.
#define   BF_OSCICL_5    5         // Internal Oscillator Calibration.
#define   BF_OSCICL_6    6         // Internal Oscillator Calibration.
#define   M_OSCICL       0x7F      // Internal Oscillator Calibration.

