LA7LKA/AmateurRadioDMRRepeater/software/SiLabs/Si446x_EmptyFramework/src/drivers/C8051F910_defs_add.h
// SFR Definition 19.4. OSCXCN: External Oscillator Control
#define   B_XCLKVLD      7         // External Oscillator Valid Flag.
#define   M_XCLKVLD      0x80      // External Oscillator Valid Flag.
#define   BF_XOSCMD      4         // External Oscillator Mode Bits.
#define   BF_XOSCMD_0    4         // External Oscillator Mode Bits.
#define   BF_XOSCMD_1    5         // External Oscillator Mode Bits.
#define   BF_XOSCMD_2    6         // External Oscillator Mode Bits.
#define   M_XOSCMD       0x70      // External Oscillator Mode Bits.
#define   BF_XFCN        0         // External Oscillator Frequency Control Bits.
#define   BF_XFCN_0      0         // External Oscillator Frequency Control Bits.
#define   BF_XFCN_1      1         // External Oscillator Frequency Control Bits.
#define   BF_XFCN_2      2         // External Oscillator Frequency Control Bits.
#define   M_XFCN         0x07      // External Oscillator Frequency Control Bits.

// SFR Definition 20.2. RTC0ADR: SmaRTClock Address
#define   B_RTC0ADR_BUSY         7         // SmaRTClock Interface Busy Indicator.
#define   M_RTC0ADR_BUSY         0x80      // SmaRTClock Interface Busy Indicator.
#define   B_AUTORD       6         // SmaRTClock Interface Autoread Enable. 
#define   M_AUTORD       0x40      // SmaRTClock Interface Autoread Enable. 
#define   B_SHORT        4         // Short Strobe Enable. 
#define   M_SHORT        0x10      // Short Strobe Enable. 
#define   BF_ADDR        0         // Indirect Register Address.
#define   BF_ADDR_0      0         // Indirect Register Address.
#define   BF_ADDR_1      1         // Indirect Register Address.
#define   BF_ADDR_2      2         // Indirect Register Address.
#define   BF_ADDR_3      3         // Indirect Register Address.
#define   M_ADDR         0x0F      // Indirect Register Address.

// Internal Register Definition 20.4. RTC0CN: SmaRTClock Control
#define   B_RTC0EN       7         // SmaRTClock Enable. 
#define   M_RTC0EN       0x80      // SmaRTClock Enable. 
#define   B_MCLKEN       6         // Missing SmaRTClock Detector Enable.
#define   M_MCLKEN       0x40      // Missing SmaRTClock Detector Enable.
#define   B_OSCFAIL      5         // SmaRTClock Oscillator Fail Event Flag.
#define   M_OSCFAIL      0x20      // SmaRTClock Oscillator Fail Event Flag.
#define   B_RTC0TR       4         // SmaRTClock Timer Run Control. 
#define   M_RTC0TR       0x10      // SmaRTClock Timer Run Control. 
#define   B_ALRM         2         // SmaRTClock Alarm Event 
#define   M_ALRM         0x04      // SmaRTClock Alarm Event 
#define   B_RTC0SET      1         // SmaRTClock Timer Set.
#define   M_RTC0SET      0x02      // SmaRTClock Timer Set.

// Internal Register Definition 20.5. RTC0XCN: SmaRTClock Oscillator Control
#define   B_AGCEN        7         // SmaRTClock Oscillator Automatic Gain Control (AGC) Enable.
#define   M_AGCEN        0x80      // SmaRTClock Oscillator Automatic Gain Control (AGC) Enable.
#define   B_BIASX2       5         // SmaRTClock Oscillator Bias Double Enable. 
#define   M_BIASX2       0x20      // SmaRTClock Oscillator Bias Double Enable. 
#define   B_CLKVLD       4         // SmaRTClock Oscillator Crystal Valid Indicator. 
#define   M_CLKVLD       0x10      // SmaRTClock Oscillator Crystal Valid Indicator. 
#define   B_LFOEN        3         // Low Frequency Oscillator Enable and Select.
#define   M_LFOEN        0x08      // Low Frequency Oscillator Enable and Select.

// Internal Register Definition 20.6. RTC0XCF: SmaRTClock Oscillator Configuration
#define   B_AUTOSTP      7         // Automatic Load Capacitance Stepping Enable.
#define   M_AUTOSTP      0x80      // Automatic Load Capacitance Stepping Enable.
#define   B_LOADRDY      6         // Load Capacitance Ready Indicator. 
#define   M_LOADRDY      0x40      // Load Capacitance Ready Indicator. 
#define   BF_LOADCAP     0         // Load Capacitance Programmed Value.
#define   BF_LOADCAP_0   0         // Load Capacitance Programmed Value.
#define   BF_LOADCAP_1   1         // Load Capacitance Programmed Value.
#define   BF_LOADCAP_2   2         // Load Capacitance Programmed Value.
#define   BF_LOADCAP_3   3         // Load Capacitance Programmed Value.
#define   M_LOADCAP      0x0F      // Load Capacitance Programmed Value.

// SFR Definition 21.1. XBR0: Port I/O Crossbar Register 0
#define   B_CP1AE        7         // Comparator1 Asynchronous Output Enable. 
#define   M_CP1AE        0x80      // Comparator1 Asynchronous Output Enable. 
#define   B_CP1E         6         // Comparator1 Output Enable. 
#define   M_CP1E         0x40      // Comparator1 Output Enable. 
#define   B_CP0AE        5         // Comparator0 Asynchronous Output Enable. 
#define   M_CP0AE        0x20      // Comparator0 Asynchronous Output Enable. 
#define   B_CP0E         4         // Comparator0 Output Enable. 
#define   M_CP0E         0x10      // Comparator0 Output Enable. 
#define   B_SYSCKE       3         // SYSCLKOutput Enable. 
#define   M_SYSCKE       0x08      // SYSCLKOutput Enable. 
#define   B_SMB0E        2         // SMBus I/O Enable. 
#define   M_SMB0E        0x04      // SMBus I/O Enable. 
#define   B_SPI0E        1         // SPI0 I/O Enable.
#define   M_SPI0E        0x02      // SPI0 I/O Enable.
#define   B_URT0E        0         // UART0 Output Enable.
#define   M_URT0E        0x01      // UART0 Output Enable.

// SFR Definition 21.2. XBR1: Port I/O Crossbar Register 1
#define   B_SPI1E        6         // SPI1 I/O Enable.
#define   M_SPI1E        0x40      // SPI1 I/O Enable.
#define   B_T1E          5         // Timer1 Input Enable. 
#define   M_T1E          0x20      // Timer1 Input Enable. 
#define   B_T0E          4         // Timer0 Input Enable. 
#define   M_T0E          0x10      // Timer0 Input Enable. 
#define   B_ECIE         3         // PCA0 External Counter Input (ECI) Enable.
#define   M_ECIE         0x08      // PCA0 External Counter Input (ECI) Enable.
#define   BF_PCA0ME      0         // PCA0 Module I/O Enable.
#define   BF_PCA0ME_0    0         // PCA0 Module I/O Enable.
#define   BF_PCA0ME_1    1         // PCA0 Module I/O Enable.
#define   BF_PCA0ME_2    2         // PCA0 Module I/O Enable.
#define   M_PCA0ME       0x07      // PCA0 Module I/O Enable.

// SFR Definition 21.3. XBR2: Port I/O Crossbar Register 2
#define   B_WEAKPUD      7         // Port I/O Weak Pullup Disable.
#define   M_WEAKPUD      0x80      // Port I/O Weak Pullup Disable.
#define   B_XBARE        6         // Crossbar Enable.
#define   M_XBARE        0x40      // Crossbar Enable.

// SFR Definition 21.13. P1: Port1
#define   BF_P1          0         // Port 1 Data. 
#define   BF_P1_0        0         // Port 1 Data. 
#define   BF_P1_1        1         // Port 1 Data. 
#define   BF_P1_2        2         // Port 1 Data. 
#define   BF_P1_3        3         // Port 1 Data. 
#define   BF_P1_4        4         // Port 1 Data. 
#define   BF_P1_5        5         // Port 1 Data. 
#define   BF_P1_6        6         // Port 1 Data. 
#define   M_P1           0x7F      // Port 1 Data. 

// SFR Definition 21.14. P1SKIP: Port1 Skip 
#define   BF_P1SKIP      0         // Port 1 Crossbar Skip Enable Bits.
#define   BF_P1SKIP_0    0         // Port 1 Crossbar Skip Enable Bits.
#define   BF_P1SKIP_1    1         // Port 1 Crossbar Skip Enable Bits.
#define   BF_P1SKIP_2    2         // Port 1 Crossbar Skip Enable Bits.
#define   BF_P1SKIP_3    3         // Port 1 Crossbar Skip Enable Bits.
#define   BF_P1SKIP_4    4         // Port 1 Crossbar Skip Enable Bits.
#define   BF_P1SKIP_5    5         // Port 1 Crossbar Skip Enable Bits.
#define   BF_P1SKIP_6    6         // Port 1 Crossbar Skip Enable Bits.
#define   M_P1SKIP       0x7F      // Port 1 Crossbar Skip Enable Bits.

// SFR Definition 21.15. P1MDIN: Port1 Input Mode
#define   BF_P1MDIN      0         // Analog Configuration Bits for P1.6–P1.0 (respectively).
#define   BF_P1MDIN_0    0         // Analog Configuration Bits for P1.6–P1.0 (respectively).
#define   BF_P1MDIN_1    1         // Analog Configuration Bits for P1.6–P1.0 (respectively).
#define   BF_P1MDIN_2    2         // Analog Configuration Bits for P1.6–P1.0 (respectively).
#define   BF_P1MDIN_3    3         // Analog Configuration Bits for P1.6–P1.0 (respectively).
#define   BF_P1MDIN_4    4         // Analog Configuration Bits for P1.6–P1.0 (respectively).
#define   BF_P1MDIN_5    5         // Analog Configuration Bits for P1.6–P1.0 (respectively).
#define   BF_P1MDIN_6    6         // Analog Configuration Bits for P1.6–P1.0 (respectively).
#define   M_P1MDIN       0x7F      // Analog Configuration Bits for P1.6–P1.0 (respectively).

