LA7LKA/AmateurRadioDMRRepeater/software/SiLabs/Si446x_EmptyFramework/src/drivers/C8051F910_defs_add.h
// SFR Definition 21.16. P1MDOUT: Port1 Output Mode
#define   BF_P1MDOUT     0         // Output Configuration Bits for P1.6–P1.0 (respectively).
#define   BF_P1MDOUT_0   0         // Output Configuration Bits for P1.6–P1.0 (respectively).
#define   BF_P1MDOUT_1   1         // Output Configuration Bits for P1.6–P1.0 (respectively).
#define   BF_P1MDOUT_2   2         // Output Configuration Bits for P1.6–P1.0 (respectively).
#define   BF_P1MDOUT_3   3         // Output Configuration Bits for P1.6–P1.0 (respectively).
#define   BF_P1MDOUT_4   4         // Output Configuration Bits for P1.6–P1.0 (respectively).
#define   BF_P1MDOUT_5   5         // Output Configuration Bits for P1.6–P1.0 (respectively).
#define   BF_P1MDOUT_6   6         // Output Configuration Bits for P1.6–P1.0 (respectively).
#define   M_P1MDOUT      0x7F      // Output Configuration Bits for P1.6–P1.0 (respectively).

// SFR Definition 21.17. P1DRV: Port1 Drive Strength
#define   BF_P1DRV       0         // Drive Strength Configuration Bits for P1.6–P1.0 (respectively).
#define   BF_P1DRV_0     0         // Drive Strength Configuration Bits for P1.6–P1.0 (respectively).
#define   BF_P1DRV_1     1         // Drive Strength Configuration Bits for P1.6–P1.0 (respectively).
#define   BF_P1DRV_2     2         // Drive Strength Configuration Bits for P1.6–P1.0 (respectively).
#define   BF_P1DRV_3     3         // Drive Strength Configuration Bits for P1.6–P1.0 (respectively).
#define   BF_P1DRV_4     4         // Drive Strength Configuration Bits for P1.6–P1.0 (respectively).
#define   BF_P1DRV_5     5         // Drive Strength Configuration Bits for P1.6–P1.0 (respectively).
#define   BF_P1DRV_6     6         // Drive Strength Configuration Bits for P1.6–P1.0 (respectively).
#define   M_P1DRV        0x7F      // Drive Strength Configuration Bits for P1.6–P1.0 (respectively).

// SFR Definition 21.18. P2: Port2
#define   B_P2           7         // Port 2 Data. 
#define   M_P2           0x80      // Port 2 Data. 

// SFR Definition 21.19. P2MDOUT: Port2 Output Mode
#define   B_P2MDOUT      7         // Output Configuration Bits for P2.7.
#define   M_P2MDOUT      0x80      // Output Configuration Bits for P2.7.

// SFR Definition 21.20. P2DRV: Port2 Drive Strength
#define   B_P2DRV        7         // Drive Strength Configuration Bits for P2.7.
#define   M_P2DRV        0x80      // Drive Strength Configuration Bits for P2.7.

// SFR Definition 22.1. SMB0CF: SMBus Clock/Configuration
#define   B_ENSMB        7         // SMBus Enable.
#define   M_ENSMB        0x80      // SMBus Enable.
#define   B_INH          6         // SMBus Slave Inhibit.
#define   M_INH          0x40      // SMBus Slave Inhibit.
#define   B_BUSY         5         // SMBus Busy Indicator.
#define   M_BUSY         0x20      // SMBus Busy Indicator.
#define   B_EXTHOLD      4         // SMBus Setup and Hold Time Extension Enable.
#define   M_EXTHOLD      0x10      // SMBus Setup and Hold Time Extension Enable.
#define   B_SMBTOE       3         // SMBus SCL Timeout Detection Enable.
#define   M_SMBTOE       0x08      // SMBus SCL Timeout Detection Enable.
#define   B_SMBFTE       2         // SMBus Free Timeout Detection Enable.
#define   M_SMBFTE       0x04      // SMBus Free Timeout Detection Enable.
#define   BF_SMBCS       0         // SMBus Clock Source Selection.
#define   BF_SMBCS_0     0         // SMBus Clock Source Selection.
#define   BF_SMBCS_1     1         // SMBus Clock Source Selection.
#define   M_SMBCS        0x03      // SMBus Clock Source Selection.

// SFR Definition 22.2. SMB0CN: SMBus Control
#define   B_MASTER       7         // SMBus Master/Slave 
#define   M_MASTER       0x80      // SMBus Master/Slave 
#define   B_TXMODE       6         // SMBus Transmit Mode 
#define   M_TXMODE       0x40      // SMBus Transmit Mode 
#define   B_STA          5         // SMBus Start Flag. 0: No Start or repeated 
#define   M_STA          0x20      // SMBus Start Flag. 0: No Start or repeated 
#define   B_STO          4         // SMBus Stop Flag. 0: No Stop condition 
#define   M_STO          0x10      // SMBus Stop Flag. 0: No Stop condition 
#define   B_ACKRQ        3         // SMBus Acknowledge 
#define   M_ACKRQ        0x08      // SMBus Acknowledge 
#define   B_ACK          1         // SMBus Acknowledge. 0: NACK received.
#define   M_ACK          0x02      // SMBus Acknowledge. 0: NACK received.
#define   B_SI           0         // SMBus Interrupt Flag.
#define   M_SI           0x01      // SMBus Interrupt Flag.

// SFR Definition 22.3. SMB0ADR: SMBus Slave Address
#define   BF_SLV         1         // SMBus Hardware Slave Address.
#define   BF_SLV_0       1         // SMBus Hardware Slave Address.
#define   BF_SLV_1       2         // SMBus Hardware Slave Address.
#define   BF_SLV_2       3         // SMBus Hardware Slave Address.
#define   BF_SLV_3       4         // SMBus Hardware Slave Address.
#define   BF_SLV_4       5         // SMBus Hardware Slave Address.
#define   BF_SLV_5       6         // SMBus Hardware Slave Address.
#define   BF_SLV_6       7         // SMBus Hardware Slave Address.
#define   M_SLV          0xFE      // SMBus Hardware Slave Address.
#define   B_GC           0         // General Call Address Enable.
#define   M_GC           0x01      // General Call Address Enable.

// SFR Definition 22.4. SMB0ADM: SMBus Slave Address Mask
#define   BF_SLVM        1         // SMBus Slave Address Mask.
#define   BF_SLVM_0      1         // SMBus Slave Address Mask.
#define   BF_SLVM_1      2         // SMBus Slave Address Mask.
#define   BF_SLVM_2      3         // SMBus Slave Address Mask.
#define   BF_SLVM_3      4         // SMBus Slave Address Mask.
#define   BF_SLVM_4      5         // SMBus Slave Address Mask.
#define   BF_SLVM_5      6         // SMBus Slave Address Mask.
#define   BF_SLVM_6      7         // SMBus Slave Address Mask.
#define   M_SLVM         0xFE      // SMBus Slave Address Mask.
#define   B_EHACK        0         // Hardware Acknowledge Enable.
#define   M_EHACK        0x01      // Hardware Acknowledge Enable.

// SFR Definition 23.1. SCON0: Serial Port 0 Control
#define   B_S0MODE       7         // Serial Port 0 Operation Mode.
#define   M_S0MODE       0x80      // Serial Port 0 Operation Mode.
#define   B_MCE0         5         // Multiprocessor Communication Enable.
#define   M_MCE0         0x20      // Multiprocessor Communication Enable.
#define   B_REN0         4         // Receive Enable.
#define   M_REN0         0x10      // Receive Enable.
#define   B_TB80         3         // Ninth Transmission Bit.
#define   M_TB80         0x08      // Ninth Transmission Bit.
#define   B_RB80         2         // Ninth Receive Bit.
#define   M_RB80         0x04      // Ninth Receive Bit.
#define   B_TI0          1         // Transmit Interrupt Flag.
#define   M_TI0          0x02      // Transmit Interrupt Flag.
#define   B_RI0          0         // Receive Interrupt Flag. 
#define   M_RI0          0x01      // Receive Interrupt Flag. 

// SFR Definition 23.2. SBUF0: Serial (UART0) Port Data Buffer
#define   BF_SBUF0       0         // Serial Data Buffer Bits 7:0 (MSB–LSB).
#define   BF_SBUF0_0     0         // Serial Data Buffer Bits 7:0 (MSB–LSB).
#define   BF_SBUF0_1     1         // Serial Data Buffer Bits 7:0 (MSB–LSB).
#define   BF_SBUF0_2     2         // Serial Data Buffer Bits 7:0 (MSB–LSB).
#define   BF_SBUF0_3     3         // Serial Data Buffer Bits 7:0 (MSB–LSB).
#define   BF_SBUF0_4     4         // Serial Data Buffer Bits 7:0 (MSB–LSB).
#define   BF_SBUF0_5     5         // Serial Data Buffer Bits 7:0 (MSB–LSB).
#define   BF_SBUF0_6     6         // Serial Data Buffer Bits 7:0 (MSB–LSB).
#define   BF_SBUF0_7     7         // Serial Data Buffer Bits 7:0 (MSB–LSB).
#define   M_SBUF0        0xFF      // Serial Data Buffer Bits 7:0 (MSB–LSB).

