LA7LKA/AmateurRadioDMRRepeater/software/SiLabs/Si446x_EmptyFramework/src/drivers/C8051F910_defs_add.h
// SFR Definition 25.3. TMOD: Timer Mode
#define   B_GATE1        7         // Timer 1 Gate Control.
#define   M_GATE1        0x80      // Timer 1 Gate Control.
#define   BF_T1M         4         // Timer 1 Mode Select. 
#define   BF_T1M_0       4         // Timer 1 Mode Select. 
#define   BF_T1M_1       5         // Timer 1 Mode Select. 
#define   M_T1M          0x30      // Timer 1 Mode Select. 
#define   B_GATE0        3         // Timer 0 Gate Control.
#define   M_GATE0        0x08      // Timer 0 Gate Control.
#define   BF_T0M         0         // Timer 0 Mode Select. 
#define   BF_T0M_0       0         // Timer 0 Mode Select. 
#define   BF_T0M_1       1         // Timer 0 Mode Select. 
#define   M_T0M          0x03      // Timer 0 Mode Select. 

// SFR Definition 25.8. TMR2CN: Timer 2 Control
#define   B_TF2H         7         // Timer 2 High Byte Overflow Flag.
#define   M_TF2H         0x80      // Timer 2 High Byte Overflow Flag.
#define   B_TF2L         6         // Timer 2 Low Byte Overflow Flag.
#define   M_TF2L         0x40      // Timer 2 Low Byte Overflow Flag.
#define   B_TF2LEN       5         // Timer 2 Low Byte Interrupt Enable.
#define   M_TF2LEN       0x20      // Timer 2 Low Byte Interrupt Enable.
#define   B_TF2CEN       4         // Timer 2 Capture Enable.
#define   M_TF2CEN       0x10      // Timer 2 Capture Enable.
#define   B_T2SPLIT      3         // Timer 2 Split Mode Enable.
#define   M_T2SPLIT      0x08      // Timer 2 Split Mode Enable.
#define   B_TR2          2         // Timer 2 Run Control. 
#define   M_TR2          0x04      // Timer 2 Run Control. 
#define   BF_T2XCLK      0         // Timer 2 External Clock Select.
#define   BF_T2XCLK_0    0         // Timer 2 External Clock Select.
#define   BF_T2XCLK_1    1         // Timer 2 External Clock Select.
#define   M_T2XCLK       0x03      // Timer 2 External Clock Select.

// SFR Definition 25.13. TMR3CN: Timer 3 Control
#define   B_TF3H         7         // Timer 3 High Byte Overflow Flag.
#define   M_TF3H         0x80      // Timer 3 High Byte Overflow Flag.
#define   B_TF3L         6         // Timer 3 Low Byte Overflow Flag.
#define   M_TF3L         0x40      // Timer 3 Low Byte Overflow Flag.
#define   B_TF3LEN       5         // Timer 3 Low Byte Interrupt Enable.
#define   M_TF3LEN       0x20      // Timer 3 Low Byte Interrupt Enable.
#define   B_TF3CEN       4         // Timer 3 Comparator 1/External Oscillator Capture Enable.
#define   M_TF3CEN       0x10      // Timer 3 Comparator 1/External Oscillator Capture Enable.
#define   B_T3SPLIT      3         // Timer 3 Split Mode Enable.
#define   M_T3SPLIT      0x08      // Timer 3 Split Mode Enable.
#define   B_TR3          2         // Timer 3 Run Control. 
#define   M_TR3          0x04      // Timer 3 Run Control. 
#define   BF_T3XCLK      0         // Timer 3 External Clock Select.
#define   BF_T3XCLK_0    0         // Timer 3 External Clock Select.
#define   BF_T3XCLK_1    1         // Timer 3 External Clock Select.
#define   M_T3XCLK       0x03      // Timer 3 External Clock Select.

// SFR Definition 26.1. PCA0CN: PCA Control
#define   B_CF           7         // PCA Counter/Timer Overflow Flag.
#define   M_CF           0x80      // PCA Counter/Timer Overflow Flag.
#define   B_CR           6         // PCA Counter/Timer Run Control. 
#define   M_CR           0x40      // PCA Counter/Timer Run Control. 
#define   BF_CCF         0         // PCA Module n Capture/Compare Flag. 
#define   BF_CCF_0       0         // PCA Module n Capture/Compare Flag. 
#define   BF_CCF_1       1         // PCA Module n Capture/Compare Flag. 
#define   BF_CCF_2       2         // PCA Module n Capture/Compare Flag. 
#define   BF_CCF_3       3         // PCA Module n Capture/Compare Flag. 
#define   BF_CCF_4       4         // PCA Module n Capture/Compare Flag. 
#define   BF_CCF_5       5         // PCA Module n Capture/Compare Flag. 
#define   M_CCF          0x3F      // PCA Module n Capture/Compare Flag. 

// SFR Definition 26.2. PCA0MD: PCA Mode
#define   B_CIDL         7         // PCA Counter/Timer Idle Control.
#define   M_CIDL         0x80      // PCA Counter/Timer Idle Control.
#define   B_WDTE         6         // Watchdog Timer Enable.
#define   M_WDTE         0x40      // Watchdog Timer Enable.
#define   B_WDLCK        5         // Watchdog Timer Lock.
#define   M_WDLCK        0x20      // Watchdog Timer Lock.
#define   BF_CPS         1         // PCA Counter/Timer Pulse Select. 
#define   BF_CPS_0       1         // PCA Counter/Timer Pulse Select. 
#define   BF_CPS_1       2         // PCA Counter/Timer Pulse Select. 
#define   BF_CPS_2       3         // PCA Counter/Timer Pulse Select. 
#define   M_CPS          0x0E      // PCA Counter/Timer Pulse Select. 
#define   B_ECF          0         // PCA Counter/Timer Overflow Interrupt Enable. 
#define   M_ECF          0x01      // PCA Counter/Timer Overflow Interrupt Enable. 

// SFR Definition 26.3. PCA0PWM: PCA PWM Configuration
#define   B_ARSEL        7         // Auto-Reload Register Select.
#define   M_ARSEL        0x80      // Auto-Reload Register Select.
#define   B_ECOV         6         // Cycle Overflow Interrupt Enable.
#define   M_ECOV         0x40      // Cycle Overflow Interrupt Enable.
#define   B_COVF         5         // Cycle Overflow Flag.
#define   M_COVF         0x20      // Cycle Overflow Flag.
#define   BF_CLSEL       0         // Length Select.
#define   BF_CLSEL_0     0         // Length Select.
#define   BF_CLSEL_1     1         // Length Select.
#define   M_CLSEL        0x03      // Length Select.

// SFR Definition 26.4. PCA0CPM0: PCA Capture/Compare Mode
#define   B_ECOM0        6         // Comparator Function Enable.
#define   M_ECOM0        0x40      // Comparator Function Enable.
#define   B_CAPP0        5         // Capture Positive Function Enable. 
#define   M_CAPP0        0x20      // Capture Positive Function Enable. 
#define   B_CAPN0        4         // Capture Negative Function Enable. 
#define   M_CAPN0        0x10      // Capture Negative Function Enable. 
#define   B_MAT0         3         // Match Function Enable. 
#define   M_MAT0         0x08      // Match Function Enable. 
#define   B_TOG0         2         // Toggle Function Enable. 
#define   M_TOG0         0x04      // Toggle Function Enable. 
#define   B_PWM0         1         // Pulse Width Modulation Mode Enable.
#define   M_PWM0         0x02      // Pulse Width Modulation Mode Enable.
#define   B_ECCF0        0         // Capture/Compare Flag Interrupt Enable. 
#define   M_ECCF0        0x01      // Capture/Compare Flag Interrupt Enable. 

