LA7LKA/AmateurRadioDMRRepeater/software/SiLabs/Si446x_EmptyFramework/src/drivers/C8051F910_defs_add.h
// SFR Definition   26.4.  PCA0CPM1: PCA Capture/Compare Mode
#define   B_ECOM1        6         // Comparator Function Enable.
#define   M_ECOM1        0x40      // Comparator Function Enable.
#define   B_CAPP1        5         // Capture Positive Function Enable.
#define   M_CAPP1        0x20      // Capture Positive Function Enable.
#define   B_CAPN1        4         // Capture Negative Function Enable.
#define   M_CAPN1        0x10      // Capture Negative Function Enable.
#define   B_MAT1         3         // Match Function Enable.
#define   M_MAT1         0x08      // Match Function Enable.
#define   B_TOG1         2         // Toggle Function Enable.
#define   M_TOG1         0x04      // Toggle Function Enable.
#define   B_PWM1         1         // Pulse Width Modulation Mode Enable.
#define   M_PWM1         0x02      // Pulse Width Modulation Mode Enable.
#define   B_ECCF1        0         // Capture/Compare Flag Interrupt Enable.
#define   M_ECCF1        0x01      // Capture/Compare Flag Interrupt Enable.

// SFR Definition   26.4.  PCA0CPM2: PCA Capture/Compare Mode
#define   B_ECOM2        6         // Comparator Function Enable.
#define   M_ECOM2        0x40      // Comparator Function Enable.
#define   B_CAPP2        5         // Capture Positive Function Enable.
#define   M_CAPP2        0x20      // Capture Positive Function Enable.
#define   B_CAPN2        4         // Capture Negative Function Enable.
#define   M_CAPN2        0x10      // Capture Negative Function Enable.
#define   B_MAT2         3         // Match Function Enable.
#define   M_MAT2         0x08      // Match Function Enable.
#define   B_TOG2         2         // Toggle Function Enable.
#define   M_TOG2         0x04      // Toggle Function Enable.
#define   B_PWM2         1         // Pulse Width Modulation Mode Enable.
#define   M_PWM2         0x02      // Pulse Width Modulation Mode Enable.
#define   B_ECCF2        0         // Capture/Compare Flag Interrupt Enable.
#define   M_ECCF2        0x01      // Capture/Compare Flag Interrupt Enable.

// SFR Definition   26.4.  PCA0CPM3: PCA Capture/Compare Mode
#define   B_ECOM3        6         // Comparator Function Enable.
#define   M_ECOM3        0x40      // Comparator Function Enable.
#define   B_CAPP3        5         // Capture Positive Function Enable.
#define   M_CAPP3        0x20      // Capture Positive Function Enable.
#define   B_CAPN3        4         // Capture Negative Function Enable.
#define   M_CAPN3        0x10      // Capture Negative Function Enable.
#define   B_MAT3         3         // Match Function Enable.
#define   M_MAT3         0x08      // Match Function Enable.
#define   B_TOG3         2         // Toggle Function Enable.
#define   M_TOG3         0x04      // Toggle Function Enable.
#define   B_PWM3         1         // Pulse Width Modulation Mode Enable.
#define   M_PWM3         0x02      // Pulse Width Modulation Mode Enable.
#define   B_ECCF3        0         // Capture/Compare Flag Interrupt Enable.
#define   M_ECCF3        0x01      // Capture/Compare Flag Interrupt Enable.

// SFR Definition   26.4.  PCA0CPM4: PCA Capture/Compare Mode
#define   B_ECOM4        6         // Comparator Function Enable.
#define   M_ECOM4        0x40      // Comparator Function Enable.
#define   B_CAPP4        5         // Capture Positive Function Enable.
#define   M_CAPP4        0x20      // Capture Positive Function Enable.
#define   B_CAPN4        4         // Capture Negative Function Enable.
#define   M_CAPN4        0x10      // Capture Negative Function Enable.
#define   B_MAT4         3         // Match Function Enable.
#define   M_MAT4         0x08      // Match Function Enable.
#define   B_TOG4         2         // Toggle Function Enable.
#define   M_TOG4         0x04      // Toggle Function Enable.
#define   B_PWM4         1         // Pulse Width Modulation Mode Enable.
#define   M_PWM4         0x02      // Pulse Width Modulation Mode Enable.
#define   B_ECCF4        0         // Capture/Compare Flag Interrupt Enable.
#define   M_ECCF4        0x01      // Capture/Compare Flag Interrupt Enable.

// SFR Definition   26.4.  PCA0CPM5: PCA Capture/Compare Mode
#define   B_ECOM5        6         // Comparator Function Enable.
#define   M_ECOM5        0x40      // Comparator Function Enable.
#define   B_CAPP5        5         // Capture Positive Function Enable.
#define   M_CAPP5        0x20      // Capture Positive Function Enable.
#define   B_CAPN5        4         // Capture Negative Function Enable.
#define   M_CAPN5        0x10      // Capture Negative Function Enable.
#define   B_MAT5         3         // Match Function Enable.
#define   M_MAT5         0x08      // Match Function Enable.
#define   B_TOG5         2         // Toggle Function Enable.
#define   M_TOG5         0x04      // Toggle Function Enable.
#define   B_PWM5         1         // Pulse Width Modulation Mode Enable.
#define   M_PWM5         0x02      // Pulse Width Modulation Mode Enable.
#define   B_ECCF5        0         // Capture/Compare Flag Interrupt Enable.
#define   M_ECCF5        0x01      // Capture/Compare Flag Interrupt Enable.
